---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.InvalidSketch
source: html/4b0f6cbd-0873-8772-2104-610aae2e9770.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.InvalidSketch Property

Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidSketch { get; }
```